# Nama : Fitra Noviarji
# Nim :  2109106017
# POSTTEST 4

In [3]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
import numpy as np

In [4]:
dataset = pd.read_csv('posttestcoba.csv')
dataset

,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price
0,Royal Enfield Classic 350,175000,2019,Individual,1st owner,350,NaN
1,Honda Dio,45000,2017,Individual,1st owner,5650,NaN
2,Royal Enfield Classic Gunmetal Grey,150000,2018,Individual,1st owner,12000,148114.0
3,Yamaha Fazer FI V 2.0 [2016-2018],65000,2015,Individual,1st owner,23000,89643.0
4,Yamaha SZ [2013-2014],20000,2011,Individual,2nd owner,21000,NaN
...,...,...,...,...,...,...,...
1056,Activa 3g,17000,2010,Individual,1st owner,500000,52000.0
1057,Honda CB twister,16000,2012,Individual,1st owner,33000,51000.0
1058,Bajaj Discover 125,15000,2013,Individual,2nd owner,35000,57000.0
1059,Honda CB Shine,12000,2009,Individual,1st owner,53000,58000.0
1060,Bajaj Pulsar 150,10000,2008,Individual,1st owner,92233,75000.0

# Bagi dataset menjadi training set dan testing set dengan proporsi 70:30

In [5]:
X = dataset.iloc[:, :-1]
y = dataset.iloc[:, -1]

In [6]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [7]:
print("Dimensi X_train : ", X_train.shape)
print("Dimensi X_test : ", X_test.shape)
print("Dimensi y_train : ", y_train.shape)
print("Dimensi y_test : ", y_test.shape)

Dimensi X_train :  (742, 6)
Dimensi X_test :  (319, 6)
Dimensi y_train :  (742,)
Dimensi y_test :  (319,)

# Lakukan Data cleaning pada data dengan nilai null

In [8]:
df = pd.read_csv("rusakcoba.csv")

In [9]:
print("Jumlah Nilai Null")
df.isna().sum()

Jumlah Nilai Null

name                   0
selling_price          5
year                   0
seller_type            0
owner                  0
km_driven              4
ex_showroom_price    440
dtype: int64

In [10]:
df[df.isnull().any(axis=1)]

,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price
0,Royal Enfield Classic 350,175000.0,2019,Individual,1st owner,350.0,NaN
1,Honda Dio,45000.0,2017,Individual,1st owner,5650.0,NaN
3,Yamaha Fazer FI V 2.0 [2016-2018],NaN,2015,Individual,1st owner,23000.0,89643.0
4,Yamaha SZ [2013-2014],NaN,2011,Individual,2nd owner,21000.0,NaN
5,Honda CB Twister,NaN,2010,Individual,1st owner,60000.0,53857.0
...,...,...,...,...,...,...,...
951,Royal Enfield Electra 5 S,90000.0,2012,Individual,1st owner,40000.0,NaN
952,Hero Honda Hunk,20000.0,2010,Individual,1st owner,17000.0,NaN
957,Bajaj Pulsar 220 DTS-i,60000.0,2014,Individual,1st owner,16000.0,NaN
958,Hero Honda CBZ extreme,40000.0,2009,Individual,1st owner,50000.0,NaN
959,Hero Honda CBZ extreme,35000.0,2012,Individual,1st owner,60000.0,NaN

In [11]:
df[['name', 'selling_price', 'year', 'seller_type', 'owner', 'km_driven', 'ex_showroom_price']] = df[['name', 'selling_price', 'year', 'seller_type', 'owner', 'km_driven', 'ex_showroom_price']]

In [12]:
df.isna().sum()

name                   0
selling_price          5
year                   0
seller_type            0
owner                  0
km_driven              4
ex_showroom_price    440
dtype: int64

# Lakukan Data cleaning pada data dengan nilai duplikat

In [13]:
df = pd.read_csv("rusakcoba.csv")
df

,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price
0,Royal Enfield Classic 350,175000.0,2019,Individual,1st owner,350.0,NaN
1,Honda Dio,45000.0,2017,Individual,1st owner,5650.0,NaN
2,Royal Enfield Classic Gunmetal Grey,150000.0,2018,Individual,1st owner,12000.0,148114.0
3,Yamaha Fazer FI V 2.0 [2016-2018],NaN,2015,Individual,1st owner,23000.0,89643.0
4,Yamaha SZ [2013-2014],NaN,2011,Individual,2nd owner,21000.0,NaN
...,...,...,...,...,...,...,...
1056,Activa 3g,17000.0,2010,Individual,1st owner,500000.0,52000.0
1057,Honda CB twister,16000.0,2012,Individual,1st owner,33000.0,51000.0
1058,Bajaj Discover 125,15000.0,2013,Individual,2nd owner,35000.0,57000.0
1059,Honda CB Shine,12000.0,2009,Individual,1st owner,53000.0,58000.0
1060,Bajaj Pulsar 150,10000.0,2008,Individual,1st owner,92233.0,75000.0

In [14]:
df[df.duplicated()]

,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price
231,TVS Apache RTR 200 4V,95000.0,2018,Individual,1st owner,9600.0,NaN
508,Bajaj Pulsar 135 LS,20000.0,2010,Individual,1st owner,80000.0,64589.0
522,Bajaj Platina 100,20000.0,2012,Individual,1st owner,16295.0,NaN
605,Hero Karizma [2003-2014],50000.0,2013,Individual,1st owner,38000.0,85766.0
607,Honda CB Hornet 160R,70000.0,2017,Individual,1st owner,35000.0,87719.0
773,Honda Activa [2000-2015],23000.0,2009,Individual,1st owner,95000.0,50267.0

In [15]:
df.drop_duplicates(inplace=True)

In [16]:
df[df.duplicated()]

Empty DataFrame
Columns: [name, selling_price, year, seller_type, owner, km_driven, ex_showroom_price]
Index: []

# Lakukan normalisasi data pada salah satu attribute menggunakan Min Max scaler

In [17]:
dataset.to_csv('cobaa.csv')

In [18]:
dataset_normalisasi = pd.read_csv('cobaa.csv')
dataset_normalisasi.head()

,Unnamed: 0,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price
0,0,Royal Enfield Classic 350,175000,2019,Individual,1st owner,350,NaN
1,1,Honda Dio,45000,2017,Individual,1st owner,5650,NaN
2,2,Royal Enfield Classic Gunmetal Grey,150000,2018,Individual,1st owner,12000,148114.0
3,3,Yamaha Fazer FI V 2.0 [2016-2018],65000,2015,Individual,1st owner,23000,89643.0
4,4,Yamaha SZ [2013-2014],20000,2011,Individual,2nd owner,21000,NaN

In [19]:
from sklearn.preprocessing import MinMaxScaler

In [20]:
min_max_scaler = MinMaxScaler()

In [21]:
x_norm = min_max_scaler.fit_transform(
    dataset_normalisasi[['selling_price', 'year', 'km_driven', 'Unnamed: 0']]
)

In [22]:
data_normalisasi = pd.DataFrame(x_norm)

In [23]:
data_normalisasi.head()

          0        1         2         3
0  0.225166  0.96875  0.000000  0.000000
1  0.052980  0.90625  0.006025  0.000943
2  0.192053  0.93750  0.013244  0.001887
3  0.079470  0.84375  0.025749  0.002830
4  0.019868  0.71875  0.023475  0.003774

# Lakukan standarisasi pada dataset

In [24]:
dataset.to_csv('cobaa.csv')

In [25]:
dataset.to_csv("cobaa.csv")

In [29]:
print("Nilai Standar Deviasi Sebelum Distandarisasi: ")
np.std(dataset)

Nilai Standar Deviasi Sebelum Distandarisasi:

selling_price        56277.752121
year                     4.299164
km_driven            51598.819373
ex_showroom_price    77434.664217
dtype: float64

In [32]:
from sklearn.preprocessing import StandardScaler

In [34]:
standard_scaler = StandardScaler()

In [45]:
x_standard = standard_scaler.fit_transform(
    dataset[['selling_price', 'year', 'km_driven']]
)

In [46]:
print("Nilai Sesudah Distandarisasi: ")
np.std(x_standard)

Nilai Sesudah Distandarisasi:

1.0

In [47]:
np.mean(x_standard)

-4.133671099414909e-15

In [48]:
data_standarisasi = pd.DataFrame(x_standard)

In [49]:
data_standarisasi.head()

          0         1         2
0  2.049866  1.193928 -0.659120
1 -0.260105  0.728722 -0.556405
2  1.605641  0.961325 -0.433340
3  0.095275  0.263515 -0.220157
4 -0.704331 -0.666899 -0.258917

# Ganti tipe data salah satu attribute angka

In [51]:
df.dtypes

name                  object
selling_price        float64
year                  object
seller_type           object
owner                 object
km_driven            float64
ex_showroom_price    float64
dtype: object

In [53]:
df['selling_price'] = df['selling_price'].astype(object)

In [54]:
df.dtypes

name                  object
selling_price         object
year                  object
seller_type           object
owner                 object
km_driven            float64
ex_showroom_price    float64
dtype: object

# Lakukan one hot encoding pada dataset yang kalian miliki

In [55]:
from sklearn.preprocessing import OneHotEncoder

In [56]:
encoder = OneHotEncoder(sparse=False)

In [58]:
encoded = encoder.fit_transform(df[['km_driven']])

In [60]:
df_onehot = pd.DataFrame(encoded)

In [62]:
df = df.join(df_onehot)

In [63]:
df.head()

,name,selling_price,year,seller_type,owner,km_driven,ex_showroom_price,0,1,2,...,296,297,298,299,300,301,302,303,304,305
0,Royal Enfield Classic 350,175000.0,2019,Individual,1st owner,350.0,NaN,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,Honda Dio,45000.0,2017,Individual,1st owner,5650.0,NaN,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,Royal Enfield Classic Gunmetal Grey,150000.0,2018,Individual,1st owner,12000.0,148114.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,Yamaha Fazer FI V 2.0 [2016-2018],NaN,2015,Individual,1st owner,23000.0,89643.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,Yamaha SZ [2013-2014],NaN,2011,Individual,2nd owner,21000.0,NaN,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0